app/controllers/guides_controller.rb

SELECT "guides".* FROM "guides"
---
  def index
    @guides = Guide.all

INSERT INTO "guides" ("name", "cpf", "cadastur", "especialties", "modalities", "email_contact", "telefone_contact", "created_at", "updated_at", "city", "state", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @guide = Guide.new(guide_params)
    @guide.user = current_user
    if @guide.save