app/views/guides/index.html.erb

        <div class="row">
            <% Guide.all.each do |guide| %>
---
SELECT "guides".* FROM "guides"